PNA Commands

termChar = "\n"            # termination character should be \n
host = "10.1.15.106"    # IP address of PNA
port = "5024"           # connection port
debugCommunication = False  # add all prints

Common commands
-------------------------------------
	*CLS 	- Clear Status
	*ESE 	- Event Status Enable
	*ESE? 	- Event Status Enable Query
	*ESR? 	- Event Status Enable Register
	*IDN? 	- Identify
	*OPC 	- Operation complete command
	*OPC? 	- Operation complete query
	*OPT? 	- Identify Options Query
	*RST 	- Reset
	*SRE 	- Service Request Enable
	*SRE? 	- Service Request Enable Query
	*STB? 	- Status Byte Query
	*TST? 	- Result of Self-test Query
	*WAI 	- Wait
-------------------------------------

PNA commands for getting data
-------------------------------------
	syst:fpr 	- Reset PNA display
	mmem:cdir? 	- Current working folder
	mmem:load 'calibrationRado.csa'	- Load default displays and calibration
	calc:par:cat?	- Names and parameters of existing measurements for the specified channel
	system:error?	- System error message return
	format:data?	- Returns data format for data transfers
	format:data ascii	- Sets the data format for data transfers
	CALCulate:PARameter:MNUMber[:SELect]? - Returns the selected measurement for the channel
	calc:par:mnum 1	- Sets the selected measurement for the channel
	mmem:stor:trace:format:snp?	- Specifies the format of subsequent .s1p, .s2p, .s3p; s4p save statements
	mmem:stor:trace:format:snp db	- Log Magnitude / degrees
	calc:data? fdata	- Reads measurement data. 
				  Formatted measurement data to or from Data Access Map location Display (access point 2)
	calc:data:snp:ports? "1,2"	- Reads SNP data from the selected measurement for the specified ports
	sens:swe:points?		- (Read) Sets the number of data points for the measurement. 
	sens:swe:points 10		- (Write) Sets the number of data points for the measurement to 10.
-------------------------------------

PNA commands examples
-------------------------------------
Measurement of 3 points from 10 to 15 GHz:
SCPI> calc:data:snp?
+1.00000000000E+010,+1.25000000000E+010,+1.50000000000E+010,-6.33523464203E+000,-7.73211956024E+000,-1.41285705566E+001,+2.88344097137E+001,+1.56112091064E+002,+3.93285369873E+001,-2.87604045868E+001,-2.48748722076E+001,-3.01594600677E+001,+7.67435989380E+001,-1.75895248413E+002,+1.03352355957E+002,-2.00000000000E+002,-2.00000000000E+002,-2.00000000000E+002,+4.50000000000E+001,+4.50000000000E+001,+4.50000000000E+001,-1.30809783936E+001,-8.86268424988E+000,-1.70680408478E+001,-1.62063613892E+002,-5.17504501343E+001,-8.06006317139E+001

SCPI> calc:data:snp:ports? "1,2"
+1.00000000000E+010,+1.25000000000E+010,+1.50000000000E+010,-6.32574558258E+000,-7.72846269608E+000,-1.40918178558E+001,+2.87701129913E+001,+1.55987731934E+002,+3.94663963318E+001,-2.86792106628E+001,-2.46747055054E+001,-3.03539371490E+001,+7.71184387207E+001,-1.76624679565E+002,+1.05690132141E+002,-2.00000000000E+002,-2.00000000000E+002,-2.00000000000E+002,+4.50000000000E+001,+4.50000000000E+001,+4.50000000000E+001,-1.30955743790E+001,-8.90437221527E+000,-1.70456104279E+001,-1.61961318970E+002,-5.16696777344E+001,-8.14277038574E+001

Select channel for the current measurement:
SCPI> calc:par:mnum 2

Measurement of 51 point in dB:
SCPI> calc:data? fdata
-2.87564700000E+001,-2.59063500000E+001,-2.58404300000E+001,-2.69318900000E+001,-2.75892800000E+001,-2.71881600000E+001,-2.77542400000E+001,-2.64293200000E+001,-2.47346900000E+001,-2.35271300000E+001,-2.33629900000E+001,-2.36062600000E+001,-2.43406300000E+001,-2.52425200000E+001,-2.72920400000E+001,-2.64375300000E+001,-2.19831100000E+001,-1.80101400000E+001,-1.68076300000E+001,-1.53671200000E+001,-1.51684100000E+001,-1.57392100000E+001,-1.84140500000E+001,-2.37119100000E+001,-2.71444700000E+001,-2.46936000000E+001,-2.43926100000E+001,-2.61731300000E+001,-2.27373000000E+001,-1.68264400000E+001,-1.45286900000E+001,-1.48712900000E+001,-1.53052500000E+001,-1.61268300000E+001,-1.81609700000E+001,-2.03086000000E+001,-2.24796300000E+001,-2.56537000000E+001,-3.22213200000E+001,-3.43654300000E+001,-2.51913100000E+001,-2.04169000000E+001,-1.82648200000E+001,-1.79926700000E+001,-1.91052200000E+001,-2.09513800000E+001,-2.43054100000E+001,-3.00940500000E+001,-3.38131700000E+001,-2.97993200000E+001,-3.04224200000E+001

Check for errors:
SCPI> system:error?
+0,"No error"

Identification of PNA:
SCPI> *IDN?
Agilent Technologies,N5230C,MY49001380,A.09.42.01
-------------------------------------
